src/CF/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихКодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихКодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихКода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыйМинимальныйОстатокТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланкаКоличестваДляЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтслеживатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьУказаниеБезСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/CommonModules/ПодключаемоеОборудованиеДСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
// ПОРЦЕДУРЫ/ФУНКЦИИ ПОИСКА И ОПРЕДЕЛЕНИЯ ТИПОВ ШтрихКодОВ

// Функция возвращает тип ШтрихКода
//
// Параметры:
// ШтрихКод - Строка
//
// Возвращаемое значение:
// ПланВидовХарактеристикСсылка
//
Функция ОпределитьТипШтрихКода(ШтрихКод) Экспорт
	
	ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.ПустаяСсылка();
	ДлинаШтрихКода = СтрДлина(ШтрихКод);
	ITF14 = Ложь;
	Сумма = 0;
	
	Если ДлинаШтрихКода = 14 Тогда //ITF14
		
		Коэффициент = 1;
		Для Сч = 1 По 13 Цикл
			КодСимв = КодСимвола(ШтрихКод, Сч);
			Если КодСимв < 48 Или КодСимв > 57 Тогда
				Прервать;
			КонецЕсли;
			Сумма = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		Если КодСимвола(ШтрихКод, 14) = Сумма + 48 Тогда
			ITF14 = Истина;
		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихКода = 13 Тогда //EAN13
		
		Коэффициент = 1;
		Для Сч = 1 По 12 Цикл
			КодСимв = КодСимвола(ШтрихКод, Сч);
			Сумма = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		ПроверочныйСимвол = Символ(Сумма + 48);
		Если ПроверочныйСимвол = Прав(ШтрихКод, 1) Тогда
			ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.EAN13;
		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихКода = 8 Тогда	//EAN8
		
		Коэффициент = 3;
		Для Сч = 1 По 7 Цикл
			КодСимв = КодСимвола(ШтрихКод, Сч);
			Если КодСимв < 48 Или КодСимв > 57 Тогда
				Прервать;
			КонецЕсли;
			Сумма = Сумма + Коэффициент * (КодСимв - 48);
			Коэффициент = 4 - Коэффициент;
		КонецЦикла;
		Сумма = (10 - Сумма % 10) % 10;
		Если КодСимвола(ШтрихКод, 8) = Сумма + 48 Тогда
			ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.EAN8;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипШтрихКода.Пустая() 
		И НЕ ITF14 Тогда //CODE39
		
		CODE39 = Ложь;
		Если ДлинаШтрихКода > 0 Тогда
			CODE39 = Истина;
			Для Сч = 1 По ДлинаШтрихКода Цикл
				КодСимв = КодСимвола(ШтрихКод, Сч);
				Если (КодСимв <> 32)
					И (КодСимв < 36 Или КодСимв > 37)
					И (КодСимв <> 43)
					И (КодСимв < 45 Или КодСимв > 57)
					И (КодСимв < 65 Или КодСимв > 90) Тогда
					
					CODE39 = Ложь;
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если CODE39 Тогда
			ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.CODE39;
		Иначе
			ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.CODE128;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипШтрихКода;
	
КонецФункции // ОпределитьТипШтрихКода()

// Функция возвращает результат поиска по ШтрихКоду в справочнике Номенклатура.
//
// Параметры:
// ШКод - Строка - проверяемый ШтрихКод
// ТольКод - Булево - признак изменения текста запроса
//
// Возвращаемое значение зависит от входного параметра ТолькоКод:
//
//   ТолькоКод = Ложь:
//    ТаблицаЗначений - колонки: Номенклатура, Цена, ЕдиницаИзмерения, Весовой
//
//   ТолькоКод = Истина
//    ТаблицаЗначений - колонки: Код
//
Функция ПоискПоШтрихКоду(ШКод, ТолькоКод = Ложь) Экспорт
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ОсновнойШтрихКод = &ОсновнойШтрихКод
		|	ИЛИ Номенклатура.ОсновнойШтрихКод = &ОсновнойШтрихКодВРЕГ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.ПометкаУдаления";

	Запрос.УстановитьПараметр("ОсновнойШтрихКод", нрег(ШКод));
	Запрос.УстановитьПараметр("ОсновнойШтрихКодВРЕГ", Врег(ШКод));

	РезультатЗапроса = Запрос.Выполнить();
если не РезультатЗапроса.Пустой() тогда
	возврат РезультатЗапроса.Выгрузить();
иначе
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	ТипШК = ОпределитьТипШтрихКода(ШКод);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Цена
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|		ПО (ШтрихКоды.Номенклатура.Ссылка = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	ШтрихКоды.ТипШтрихКода = &ТипШК
	|	И (ШтрихКоды.ШтрихКод = &ШКод
	|	ИЛИ ШтрихКоды.ШтрихКод = &ШКодВРЕГ)";
	
	Если ТолькоКод Тогда
		ЗаменяемыйТекст = "
		|	ШтрихКоды.Номенклатура КАК Номенклатура,
		|	СпрНоменклатура.Цена ";
		ТекстЗамены = "
		|	СпрНоменклатура.Код";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	Запрос.УстановитьПараметр("ШКод", нрег(ШКод));
	Запрос.УстановитьПараметр("ШКодВРЕГ", врег(ШКод));
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецЕсли;	
	
КонецФункции // ПоискПоШтрихКоду()

// Функция возвращает результат проверки полученного ШтрихКода на предмет уникальности в информационной базе.
//
// Параметры:
// ШКод - Строка - проверяемый ШтрихКод
// ТипШК - ПланВидовХарактеристикСсылка.ТипыШтрихКодов - тип ШтрихКода
//
// ВозвращаемоеЗначение:
// Булево - результат проверки.
//
Функция ПроверитьУникальностьШтрихКода(ШКод, ТипШК = Неопределено) Экспорт
	
	Уникальность = Истина;
	Если ТипШК = Неопределено Тогда
		ТипШК = ОпределитьТипШтрихКода(ШКод);
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	| ШтрихКоды.ШтрихКод КАК ШтрихКод
	|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ ШтрихКоды.ШтрихКод = &ШКод
	|И ШтрихКоды.ТипШтрихКода = &ТипШК";
	
	Запрос.УстановитьПараметр("ШКод", ШКод);
	Запрос.УстановитьПараметр("ТипШК", ТипШК);
	
	Если Запрос.Выполнить().Выгрузить().Количество() Тогда
		Уникальность = Ложь;
	КонецЕсли;
	
	Возврат Уникальность;
	
КонецФункции // ПроверитьУникальностьШтрихКода()

// Функция возвращает результат поиска по регистру сведений ШтрихКоды.
//
// Параметры:
// ТекКод - Строка - ШтрихКод,по которуму производится поиск
//
// Возвращаемое значение зависит от результат запроса:
//
//   ШтрихКод найден:
//    Структура - ключи структуры: Номенклатура, ШтрихКод, ТипШтрихКода
//
//   ШтрихКод НЕ найден:
//    Структура - ключи структуры: ШтрихКод, ТипШтрихКода
//
Функция ПоискПоРегиструСведенийШтрихКоды(ТекКод) Экспорт
	
	ТипШтрихКода = ОпределитьТипШтрихКода(ТекКод);
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихКоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод
	|	И ШтрихКоды.ТипШтрихКода = &ТипШтрихКода";
	
	Запрос.УстановитьПараметр("ШтрихКод", ТекКод);
	Запрос.УстановитьПараметр("ТипШтрихКода", ТипШтрихКода);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТипШтрихКода", ТипШтрихКода);
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда
		ТекСтрока = Выборка.Выгрузить()[0];
		СтруктураРезультата.Вставить("Владелец", ТекСтрока.Номенклатура);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции // ПоискПоРегиструСведенийШтрихКоды()

////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ/ФУНКЦИИ РАБОТЫ С КОДАМИ МАГНИТНЫХ КАРТ

// Функция возвращает результат поиска клиента в справочнике по коду магнитной карты.
//
// Параметры:
// МКод - Строка - магнитный код
//
// Возвращаемое значение:
// СправочникСсылкаКлиенты / Неопределено
//
Функция НайтиКлиентаПоМК(МКод) Экспорт
	
	Клиент = Справочники.Клиенты.НайтиПоРеквизиту("НомерКарты", МКод);
	Если Клиент.Пустая() Тогда
		Клиент = Неопределено;
	КонецЕсли;
	
	Возврат Клиент;
	
КонецФункции

// Функция возвращает результат проверки кода магнитной карты на предмет уникальности в информационной базе.
//
// Если объект уже записан и редактируется, тогда для исключения этого объекта из результат запроса
// добавляется дополнительное условие и устанавливается параметр.
//
// Параметры:
// СпрОбъект - СправочникОбъект.Клиенты - элемент справочника Клиенты
//
// Возвращаемое значение:
// Булево - результат проверки
//
Функция ПроверитьУникальностьМагнитногоКода(СпрОбъект) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	| Клиенты.НомерКарты
	|ИЗ
	| Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.НомерКарты = &МКод";
	МКод = СпрОбъект.НомерКарты;
	Запрос.УстановитьПараметр("МКод", МКод);
	Если НЕ СпрОбъект.ЭтоНовый() Тогда
		ЭлементСсылка = СпрОбъект.Ссылка;
		Запрос.Текст = Запрос.Текст + " И Клиенты.Ссылка <> &ЭлементСсылка";
		Запрос.УстановитьПараметр("ЭлементСсылка", ЭлементСсылка);
	КонецЕсли;
	Результат = Запрос.Выполнить().Пустой();
	Возврат Результат;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ/ФУНКЦИИ РАБОТЫ С ФИСКАЛЬНЫМ РЕГИСТРАТОРОМ

// Функция возвращает подключенный фискальный регистратор
//
// Возвращаемое значение:
// Результат - СправочникСсылкаПодключаемоеОборудование
// Если в справочнике несколько фискальных регистраторов или ни одного, тогда ссылка пустая.
//
Функция ВернутьИдентификаторУстройстваФР() Экспорт
	
	Результат = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ТипОборудования = &ФР
	|	И ПодключаемоеОборудование.ПометкаУдаления = Ложь";
	
	ФР = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор;
	Запрос.УстановитьПараметр("ФР", ФР);
	Оборудование = Запрос.Выполнить().Выгрузить();
	
	Если Оборудование.Количество() = 1 Тогда
		Результат = Оборудование[0].Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВернутьИдентификаторУстройстваФР()

// Функция возвращет текущее состояние кассовой смены.
//
// Возвращаемое значение:
// КассоваяСмена - Структура:
//  Ключи структуры:
//   "СтатусСмены" - если не было открыто ни одной смены
//   "СтатусСмены", "Время"
////
//Функция ПолучитьСостояниеКассовойСмены() Экспорт
//	
//	КассоваяСмена = Новый Структура;
//	Состояние = РегистрыСведений.КассоваяСмена.СрезПоследних();
//	Если Состояние.Количество() = 0 Тогда
//		КассоваяСмена.Вставить("СтатусСмены", Перечисления.СтатусыКассовойСмены.Закрыта);
//	Иначе
//		КассоваяСмена.Вставить("СтатусСмены", Состояние[0].СтатусСмены);
//		Кассоваясмена.Вставить("Время", Состояние[0].Период);
//	КонецЕсли;
//	
//	Возврат КассоваяСмена;
//	
//КонецФункции //ПолучитьСостояниеКассовойСмены()

//// Функция возвращает результат открытия кассовой смены.
////
//// Параметры:
//// ОписаниеОшибки - Строка
////
//// Возвращаемое значение:
//// Результат - Булево
////
//Функция ОткрытьКассовуюСмену(ОписаниеОшибки = "") Экспорт
//	
//	Результат = Истина;
//	
//	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены();
//	
//	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
//	Открыта = Перечисления.СтатусыКассовойСмены.Открыта;
//	
//	Если СтруктураСостояниеКассовойСмены.СтатусСмены = Открыта Тогда
//		
//		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
//		Если ДатаОткрытияКассовойСмены - СтруктураСостояниеКассовойСмены.Время < 86400 Тогда
//			
//			// Все в порядке
//			
//		Иначе
//			
//			Результат = Ложь;
//			// Вероятно, что смена была не закрыта.
//			ОписаниеОшибки = НСтр("ru = 'С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены.'");
//			
//		КонецЕсли;
//		
//	Иначе                
//		
//		// Смена закрыта. Откроем новую кассовую смену.
//		
//		НоваяКассоваяСмена = РегистрыСведений.КассоваяСмена.СоздатьМенеджерЗаписи();
//		
//		НоваяКассоваяСмена.Период = ТекущаяДатаСеанса();
//		НоваяКассоваяСмена.СтатусСмены = Открыта;
//		НоваяКассоваяСмена.Записать();
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции //ОткрытьКассовуСмену()

//// Функция возвращает результат закрытия кассовой смены.
////
//// Параметры:
//// ОписаниеОшибки - строка
////
//// Возвращаемое значение:
//// Результат - Булево
////
//Функция ЗакрытьКассовуюСмену(ОписаниеОшибки = "") Экспорт
//	
//	Результат = Истина;
//	Закрыта = Перечисления.СтатусыКассовойСмены.Закрыта;
//	СтруктураСостоянияКассовойСмены = ПолучитьСостояниеКассовойСмены();
//	
//	Если СтруктураСостоянияКассовойСмены.СтатусСмены = Закрыта Тогда
//		Результат = Ложь;
//	Иначе
//		ЗакрытиеСмены = РегистрыСведений.КассоваяСмена.СоздатьМенеджерЗаписи();
//		ЗакрытиеСмены.Период = ТекущаяДатаСеанса();
//		ЗакрытиеСмены.СтатусСмены = Закрыта;
//		ЗакрытиеСмены.Записать();
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции // ЗакрытьКассовуюСмену()

//// Функция выбирает чеки, пробитые в текущую смену и присваивает им статус Архивный
////
//// Возвращаеомое значение:
//// Результат - Булево - результат записи документов
////
//Функция ЗаархивироватьДокументыПередЗакрытиемСмены() Экспорт
//	
//	Смена = ПолучитьСостояниеКассовойСмены();
//	ДатаНачала = Смена.Время;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДемоЧек.Ссылка
//	|ИЗ
//	|	Документ.ДемоЧек КАК ДемоЧек
//	|ГДЕ
//	|	ДемоЧек.Дата > &ДатаНачала";
//	
//	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
//	ВыборкаДокументов = Запрос.Выполнить().Выгрузить();
//	
//	Результат = Истина;
//	НачатьТранзакцию();
//	Для Каждого Документ Из ВыборкаДокументов Цикл
//		
//		ДокОбъект = Документ.Ссылка.ПолучитьОбъект();
//		ДокОбъект.Архивный = Истина;
//		
//		Попытка
//			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
//		Исключение
//			Результат = Ложь;
//			Прервать;
//		КонецПопытки;
//		
//	КонецЦикла;
//	
//	Если НЕ Результат Тогда
//		ОтменитьТранзакцию();
//	Иначе
//		ЗафиксироватьТранзакцию();
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает результат проверки общей структуры адресов электронной почты клиента
// на корректность записи.
//
// Параметры:
// АдресЭП - Строка - адрес или несколько адресов электронной почты
//
// Возвращаемое значение:
// Результат - Булево - результат проверки
//
Функция ПроверитьКорректностьЗаписиАдресаЭлектроннойПочты(АдресЭП) Экспорт
	
	Результат = Истина;
	Если НЕ ПустаяСтрока(АдресЭП) Тогда
		
		ЧислоАдресов = СтрЧислоВхождений(АдресЭП,"@");
		Если ЧислоАдресов = 0 Тогда
			
			Результат = Ложь;
			
		Иначе
			
			Для к = 1 По ЧислоАдресов Цикл
				
				АТ = Найти(АдресЭП, "@");
				
				ИмяПользователя = Лев(АдресЭП,АТ-1);
				
				Если (ПустаяСтрока(ИмяПользователя) ИЛИ Найти(ИмяПользователя," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = Сред(АдресЭП, АТ+1);
				Разделитель = НайтиРазделительАдресов(АдресЭП);
				Если Разделитель = СтрДлина(АдресЭП) Тогда
					Домен = Лев(АдресЭП,Разделитель);
				Иначе
					Домен = Лев(АдресЭП,Разделитель-1);
				КонецЕсли;
				
				Если (ПустаяСтрока(Домен) ИЛИ Найти(Домен," ") <> 0) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				ЧислоТочек = СтрЧислоВхождений(Домен,".");
				
				Если НЕ (ЧислоТочек > 0 И ЧислоТочек <=2) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
				
				АдресЭП = СокрЛ(Сред(АдресЭП,Разделитель+1));
				
			КонецЦикла
			
		КонецЕсли;
		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Функция возвращает позицию символа, разделяющего два соседних адреса электронной почты,
// записанных в одной строке.
//
// Параметры:
// Стр - Строка - строка с адресам электронной почты
//
// Возвращаемое значение:
// Результат - Число - позиция разделителя
//
Функция НайтиРазделительАдресов(Стр)
	
	Результат = Найти(Стр," ");
	Если Результат = 0 Тогда
		Результат = Найти(Стр,",");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = Найти(Стр,";");
	КонецЕсли;
	Если Результат = 0 Тогда
		Результат = СтрДлина(Стр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает ф.о "Использовать подключаемое оборудование" 
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользованиеПодключаемогоОборудования");
	
КонецФункции

// Получить максимальный код SKU
//
Функция ПолучитьМаксимальныйКодSKU() Экспорт
	
	Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(Номенклатура.SKU) КАК SKU
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	Запрос = Новый Запрос(Текст);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.SKU) Тогда
			Результат = Выборка.SKU + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает первые 50 элементов из справочника Номенклатура
//
// Возвращаемое значение:
// Результат - ТаблицаЗначений - таблица товаров
//
Функция ВыбратьДемоДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Характеристика,
	|	Номенклатура.ЕдиницаИзмерения,
	|	Номенклатура.Цена,
	|	Номенклатура.СтавкаНДС,
	|	Номенклатура.Цена КАК Сумма
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = Ложь";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Вставить(6,"Количество");
	Результат.Колонки.Вставить(7,"СуммаНДС");
	
	Для Каждого СтрокаТЗ ИЗ Результат Цикл
		СтрокаТЗ.Количество = 1;
		Ставка = ВернутьСтавкуНДС(СтрокаТЗ.СтавкаНДС);
		Если Ставка <> 0 Тогда
			Сумма = СтрокаТЗ.Сумма;
			СтрокаТЗ.СуммаНДС = Окр(Сумма - Сумма/(1+Ставка),2);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает значение ставки НДС с типом Число для рассчета Суммы НДС
//
Функция ВернутьСтавкуНДС(СтавкаНДС)
	
	Ставка = 0.2;
	
	//Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
	//	Ставка = 0.10;
	//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
	//	Ставка = 0;
	//КонецЕсли;
	//
	Возврат Ставка;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////
